Revit 2027 API
Application.AllowNavigationDuringRedraw Property
 Checks whether or not the navigation during redraw is enabled, and enable or disable it.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowNavigationDuringRedraw { get; set; }
Public Property AllowNavigationDuringRedraw As Boolean
	Get
	Set
public:
property bool AllowNavigationDuringRedraw {
	bool get ();
	void set (bool value);
}
member AllowNavigationDuringRedraw : bool with get, set
Property Value
Boolean
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace